/*
 * dn-web
 * Copyright 2011 Baidu Inc. All rights reserved.
 * 
 * path:    mockup/dn.js
 * desc:    dn数据模拟
 * author:  yuanhongliang
 * date:    $Date: 2011-06-30 13:23:29 +0800 (周四, 30 六月 2011) $
 */

var sysConst = {
    "success" : "true",
    "message" : {
        
    },
    "result" : {
        "roles" : [
            {
                "v" : "1",
                "l" : "管理员" 
            },
            {
                "v" : "2",
                "l" : "销售" 
            },
            {
                "v" : "3",
                "l" : "客服" 
            },
            {
                "v" : "4",
                "l" : "客户" 
            }
        ],
        "adresource_status" : [
            {
                "v" : "1",
                "l" : "处理中"
            },
            {
	            "v" : "2", 
	            "l" : "完成"
            },
            {
                "v" : "3", 
                "l" : "失败"
            }
        ],
        "ad_status" : [
            {
                "v" : "1",
                "l" : "草稿" 
            },
            {
                "v" : "2",
                "l" : "就绪" 
            },
            {
                "v" : "3",
                "l" : "投放中" 
            },
            {
                "v" : "4",
                "l" : "投放中,达到日限" 
            },
            {
                "v" : "5",
                "l" : "完成" 
            },
            {
                "v" : "6",
                "l" : "暂停" 
            },
            {
                "v" : "7",
                "l" : "已存档" 
            }
        ],
        "ad_status_filter" : [
            {
                "v" : "100",
                "l" : "全部" 
            },
            {
                "v" : "101",
                "l" : "非存档" 
            },
            {
                "v" : "102",
                "l" : "草稿" 
            },
            {
                "v" : "103",
                "l" : "就绪" 
            },
            {
                "v" : "104",
                "l" : "投放中" 
            },
            {
                "v" : "105",
                "l" : "完成" 
            },
            {
                "v" : "106",
                "l" : "暂停" 
            },
            {
                "v" : "107",
                "l" : "已存档" 
            }
        ],
        "slot_status" : [
            {
                "v" : "0",
                "l" : "有请求" 
            },
            {
                "v" : "1",
                "l" : "无请求" 
            },
            {
                "v" : "2",
                "l" : "有效" 
            },
            {
                "v" : "3",
                "l" : "已停止" 
            },
            {
                "v" : "4",
                "l" : "已存档" 
            }
        ],
        "slot_status_filter" : [
            {
                "v" : "106",
                "l" : "非存档"
            },
            {
                "v" : "0",
                "l" : "有请求" 
            },
            {
                "v" : "1",
                "l" : "无请求" 
            },
            {
                "v" : "2",
                "l" : "有效" 
            },
            {
                "v" : "3",
                "l" : "已停止" 
            },
            {
                "v" : "4",
                "l" : "已存档" 
            },
            {
                "v" : "5",
                "l" : "全部" 
            } 
        ],
        "community_status" : [
            {
                "v" : "0",
                "l" : "正常" 
            },
            {
                "v" : "1",
                "l" : "存档" 
            }
        ],
        "material_status" : [
            {
                "v" : "0",
                "l" : "正常" 
            },
            {
                "v" : "1",
                "l" : "归档" 
            }
        ],
        "order_status" : [
            {
                "v" : "1",
                "l" : "未处理" 
            },
            {
                "v" : "2",
                "l" : "已处理" 
            },
            {
                "v" : "3",
                "l" : "已存档" 
            }
        ],
        "order_status_filter" : [
            {
                "v" : "100",
                "l" : "全部" 
            },
            {
                "v" : "101",
                "l" : "非存档" 
            },
            {
                "v" : "102",
                "l" : "未处理" 
            },
            {
                "v" : "103",
                "l" : "已处理" 
            },
            {
                "v" : "104",
                "l" : "已存档" 
            }
        ],
        "slot_type" : [
            {
                "v" : "0",
                "l" : "包断" 
            },
            {
                "v" : "1",
                "l" : "固定" 
            }
        ],
        "slot_sub_type" : [
            {
                "v" : "0",
                "l" : "泰山压顶广告位" 
            },
            {
                "v" : "1",
                "l" : "路障广告位" 
            },
            {
                "v" : "2",
                "l" : "右下广告位" 
            },
            {
                "v" : "3",
                "l" : "通栏广告位"
            },
            {
                "v" : "4",
                "l" : "画中画广告位"
            }
        ],
        "product_type" : [
            {
                "v" : "0",
                "l" : "视频" 
            },
            {
                "v" : "1",
                "l" : "浮窗" 
            },
            {
                "v" : "2",
                "l" : "路障" 
            },
            {
                "v" : "3",
                "l" : "泰山压顶" 
            },
            {
                "v" : "4",
                "l" : "通栏" 
            },
            {
                "v" : "5",
                "l" : "画中画" 
            },
            {
                "v" : "6",
                "l" : "浮标视频" 
            },
            {
                "v" : "7",
                "l" : "浮标" 
            }
        ],
        "product_price_type" : [
                                {
                                    "v" : "0",
                                    "l" : "视频cpv" 
                                },
                                {
                                    "v" : "1",
                                    "l" : "视频cpm" 
                                },
                                {
                                    "v" : "2",
                                    "l" : "浮窗" 
                                },
                                {
                                    "v" : "3",
                                    "l" : "路障" 
                                },
                                {
                                    "v" : "4",
                                    "l" : "泰山压顶" 
                                },
                                {
                                    "v" : "5",
                                    "l" : "通栏" 
                                },
                                {
                                    "v" : "6",
                                    "l" : "画中画" 
                                },
                                {
                                    "v" : "7",
                                    "l" : "浮标视频" 
                                },
                                {
                                    "v" : "8",
                                    "l" : "浮标" 
                                }
        ],
        "product_frequency_type" : [
                                {
                                    "v" : "0",
                                    "l" : "视频" 
                                },
                                {
                                    "v" : "1",
                                    "l" : "浮窗" 
                                },
                                {
                                    "v" : "2",
                                    "l" : "浮标视频" 
                                },
                                {
                                    "v" : "3",
                                    "l" : "浮标" 
                                }
        ],
        "product_slot_price_type" : [
                                {
                                    "v" : "0",
                                    "l" : "视频cpv" 
                                },
                                {
                                    "v" : "1",
                                    "l" : "视频cpm" 
                                },
                                {
                                    "v" : "2",
                                    "l" : "浮窗" 
                                },
                                {
                                    "v" : "3",
                                    "l" : "路障" 
                                },
                                {
                                    "v" : "7",
                                    "l" : "浮标视频" 
                                },
                                {
                                    "v" : "8",
                                    "l" : "浮标" 
                                }
        ],
        "orient_community_type" : [
            {
                "v" : "0",
                "l" : "不使用" 
            },
            {
                "v" : "1",
                "l" : "生活圈" 
            },
            {
                "v" : "2",
                "l" : "网站" 
            },
            {
                "v" : "3",
                "l" : "全部" 
            }
        ],
        "orient_keywords_type" : [
            {
                "v" : "0",
                "l" : "不使用" 
            },
            {
                "v" : "1",
                "l" : "使用" 
            },
            {
                "v" : "2",
                "l" : "全部" 
            }
        ],
        "material_type" : [
            {
                "v" : "0",
                "l" : "标准视频" 
            },
            {
                "v" : "5",
                "l" : "标准视频（带搜索框）"
            },
            {
                "v" : "1",
                "l" : "非标准视频" 
            },
            {
                "v" : "2",
                "l" : "Flash" 
            },
            {
                "v" : "3",
                "l" : "图片" 
            },
            {
                "v" : "4",
                "l" : "富媒体" 
            },
            {
                "v" : "6",
                "l" : "角标视频" 
            }/*,
            {
                "v" : "7",
                "l" : "标准浮窗" 
            },
            {
                "v" : "8",
                "l" : "非标准浮窗" 
            }*/
        ],
        "target_window_type" : [
            {
                "v" : "0",
                "l" : "原窗口" 
            },
            {
                "v" : "1",
                "l" : "新窗口" 
            }
        ],
        "collapse_type" : [
            {
                "v" : "0",
                "l" : "Flash" 
            },
            {
                "v" : "1",
                "l" : "图片" 
            }
        ],
        "report_trend_type" : [
            {
                "v" : "1",
                "l" : "展现量"
            },
            {
                "v" : "2",
                "l" : "点击量"
            },
            {
                "v" : "3",
                "l" : "点击率"
            },
            {
                "v" : "4",
                "l" : "展现独立访客"
            },
            {
                "v" : "5",
                "l" : "点击独立访客"
            },
            {
                "v" : "6",
                "l" : "独立访客点击率"
            },
            {
                "v" : "7",
                "l" : "消费"
            }
        ],
        "charge_mode" : [
                         {
                             "v" : "0",
                             "l" : "cpm" 
                         },
                         {
                             "v" : "1",
                             "l" : "cpv" 
                         } 
                     ],
        "report_trend_type_daily_video" : [
                               {
                                   "v" : "1",
                                   "l" : "总曝光次数"
                               },
                               {
                                   "v" : "2",
                                   "l" : "视频曝光次数"
                               },
                               {
                                   "v" : "3",
                                   "l" : "曝光独立访客"
                               },
                               {
                                   "v" : "4",
                                   "l" : "最小化视频曝光次数"
                               },
                               {
                                   "v" : "5",
                                   "l" : "有效收视次数"
                               },
                               {
                                   "v" : "6",
                                   "l" : "点击次数"
                               },
                               {
                                   "v" : "7",
                                   "l" : "点击独立访客"
                               },
                               {
                                   "v" : "8",
                                   "l" : "有效收视平均时长"
                               },
                               {
                                   "v" : "9",
                                   "l" : "CPC（元）"
                               },
                               {
                                   "v" : "10",
                                   "l" : "点击率"
                               },
                               {
                                   "v" : "11",
                                   "l" : "独立访客点击率"
                               },
                               {
                                   "v" : "12",
                                   "l" : "消费"
                               },
                               {
                                   "v" : "13",
                                   "l" : "展现量"
                               }
                           ],
                           "report_trend_type_hour_video" : [
                                                              {
                                                                  "v" : "1",
                                                                  "l" : "总曝光次数"
                                                              },
                                                              {
                                                                  "v" : "2",
                                                                  "l" : "视频曝光次数"
                                                              },
                                                              {
                                                                  "v" : "3",
                                                                  "l" : "最小化视频曝光次数"
                                                              },
                                                              {
                                                                  "v" : "4",
                                                                  "l" : "有效收视次数"
                                                              },
                                                              {
                                                                  "v" : "5",
                                                                  "l" : "点击次数"
                                                              },
                                                              {
                                                                  "v" : "6",
                                                                  "l" : "有效收视平均时长"
                                                              },
                                                              {
                                                                  "v" : "7",
                                                                  "l" : "CPC（元）"
                                                              },
                                                              {
                                                                  "v" : "8",
                                                                  "l" : "点击率"
                                                              },
                                                              {
                                                                  "v" : "9",
                                                                  "l" : "消费"
                                                              },
                                                              {
                                                                  "v" : "10",
                                                                  "l" : "展现量"
                                                              }
                                                          ],
                                                          "report_trend_type_hour_non_video": [
                                                                                               {
                                                                                                   "v" : "1",
                                                                                                   "l" : "展现量"
                                                                                               },
                                                                                               {
                                                                                                   "v" : "2",
                                                                                                   "l" : "点击量"
                                                                                               },
                                                                                               {
                                                                                                   "v" : "3",
                                                                                                   "l" : "点击率"
                                                                                               },
                                                                                               {
                                                                                                   "v" : "4",
                                                                                                   "l" : "消费"
                                                                                               }
                                                                                           ],
        region_xml_flash:[
			{
				"city":"北京市",
			    "flash": 911,
			    "xml": 1			     
			},
			{
				"city":"上海市",
			    "flash": 910,
			    "xml": 2
			},
			{
				"city":"天津市",
			    "flash":923, 
			    "xml": 3
			},
			{
				"city":"重庆市",
			    "flash": 904,
			    "xml": 4
			},
			{
				"city":"台湾省",
			    "flash": 931,
			    "xml": 7
			},
			{
				"city":"安徽省",
			    "flash": 928,
			    "xml": 8
			},
			{
				"city":"福建省",
			    "flash": 909,
			    "xml": 9
			},
			{
				"city":"甘肃省",
			    "flash": 925,
			    "xml": 10
			},
			{
				"city":"广东省",
			    "flash": 913,
			    "xml": 11
			},
			{
				"city":"广西省",
			    "flash": 912,
			    "xml": 12
			},
			{
				"city":"贵州省",
			    "flash": 902,
			    "xml": 13
			},
			{
				"city":"海南省",
			    "flash": 930,
			    "xml": 14
			},
			{
				"city":"河北省",
			    "flash": 920,
			    "xml": 15
			},
			{
				"city":"河南省",
			    "flash": 927,
			    "xml": 16
			},
			{
				"city":"黑龙江省",
			    "flash": 921,
			    "xml": 17
			},
			{
				"city":"湖北省",
			    "flash": 906,
			    "xml": 18
			},
			{
				"city":"湖南省",
			    "flash": 908,
			    "xml": 19
			},
			{
				"city":"吉林省",
			    "flash": 922,
			    "xml": 20
			},
			{
				"city":"江苏省",
			    "flash": 916,
			    "xml": 21
			},
			{
				"city":"江西省",
			    "flash": 903,
			    "xml": 22
			},
			{
				"city":"辽宁省",
			    "flash": 907,
			    "xml": 23
			},
			{
				"city":"内蒙古省",
			    "flash": 905,
			    "xml": 24
			},
			{
				"city":"宁夏省",
			    "flash": 919,
			    "xml": 25
			},
			{
				"city":"青海省",
			    "flash": 918,
			    "xml": 26
			},
			{
				"city":"山东省",
			    "flash": 901,
			    "xml": 27
			},
			{
				"city":"山西省",
			    "flash": 929,
			    "xml": 28
			},
			{
				"city":"陕西省",
			    "flash": 924,
			    "xml": 29
			},
			{
				"city":"四川省",
			    "flash": 914,
			    "xml": 30
			},
			{
				"city":"西藏省",
			    "flash": 932,
			    "xml": 31
			},
			{
				"city":"新疆省",
			    "flash": 926,
			    "xml": 32
			},
			{
				"city":"云南省",
			    "flash": 915,
			    "xml": 33
			},
			{
				"city":"浙江省",
			    "flash": 917,
			    "xml": 34
			},
			{
				"city":"全国",
				"flash": 0,
				"xml": -1
			}
        ],
        "region_info" : {
            "province" : [
                {
                    "l": "北京市",
                    "v": 1
                },
                {
                    "l": "上海市",
                    "v": 2
                },
                {
                    "l": "天津市",
                    "v": 3
                },
                {
                    "l": "重庆市",
                    "v": 4
                },
                {
                    "l": "澳门",
                    "v": 5
                },
                {
                    "l": "香港",
                    "v": 6
                },
                {
                    "l": "台湾省",
                    "v": 7
                },
                {
                    "l": "安徽省",
                    "v": 8
                },
                {
                    "l": "福建省",
                    "v": 9
                },
                {
                    "l": "甘肃省",
                    "v": 10
                },
                {
                    "l": "广东省",
                    "v": 11
                },
                {
                    "l": "广西省",
                    "v": 12
                },
                {
                    "l": "贵州省",
                    "v": 13
                },
                {
                    "l": "海南省",
                    "v": 14
                },
                {
                    "l": "河北省",
                    "v": 15
                },
                {
                    "l": "河南省",
                    "v": 16
                },
                {
                    "l": "黑龙江省",
                    "v": 17
                },
                {
                    "l": "湖北省",
                    "v": 18
                },
                {
                    "l": "湖南省",
                    "v": 19
                },
                {
                    "l": "吉林省",
                    "v": 20
                },
                {
                    "l": "江苏省",
                    "v": 21
                },
                {
                    "l": "江西省",
                    "v": 22
                },
                {
                    "l": "辽宁省",
                    "v": 23
                },
                {
                    "l": "内蒙古省",
                    "v": 24
                },
                {
                    "l": "宁夏省",
                    "v": 25
                },
                {
                    "l": "青海省",
                    "v": 26
                },
                {
                    "l": "山东省",
                    "v": 27
                },
                {
                    "l": "山西省",
                    "v": 28
                },
                {
                    "l": "陕西省",
                    "v": 29
                },
                {
                    "l": "四川省",
                    "v": 30
                },
                {
                    "l": "西藏省",
                    "v": 31
                },
                {
                    "l": "新疆省",
                    "v": 32
                },
                {
                    "l": "云南省",
                    "v": 33
                },
                {
                    "l": "浙江省",
                    "v": 34
                },
                {
                    "l": "国外",
                    "v": 999
                },
                {
                    "l": "其他",
                    "v": 0
                }
            ],
            "15": [
                {
                    "l": "保定市",
                    "v": 226
                },
                {
                    "l": "沧州市",
                    "v": 228
                },
                {
                    "l": "承德市",
                    "v": 229
                },
                {
                    "l": "邯郸市",
                    "v": 230
                },
                {
                    "l": "衡水市",
                    "v": 231
                },
                {
                    "l": "廊坊市",
                    "v": 234
                },
                {
                    "l": "秦皇岛市",
                    "v": 236
                },
                {
                    "l": "石家庄市",
                    "v": 239
                },
                {
                    "l": "唐山市",
                    "v": 240
                },
                {
                    "l": "邢台市",
                    "v": 241
                },
                {
                    "l": "张家口市",
                    "v": 242
                }
            ],
            "30": [
                {
                    "l": "阿坝藏族羌族自治州",
                    "v": 516
                },
                {
                    "l": "巴中市",
                    "v": 517
                },
                {
                    "l": "成都市",
                    "v": 518
                },
                {
                    "l": "达州市",
                    "v": 519
                },
                {
                    "l": "德阳市",
                    "v": 520
                },
                {
                    "l": "甘孜藏族自治州",
                    "v": 523
                },
                {
                    "l": "广安市",
                    "v": 524
                },
                {
                    "l": "广元市",
                    "v": 526
                },
                {
                    "l": "乐山市",
                    "v": 528
                },
                {
                    "l": "凉山彝族自治州",
                    "v": 529
                },
                {
                    "l": "泸州市",
                    "v": 530
                },
                {
                    "l": "眉山市",
                    "v": 531
                },
                {
                    "l": "绵阳市",
                    "v": 532
                },
                {
                    "l": "南充市",
                    "v": 534
                },
                {
                    "l": "内江市",
                    "v": 535
                },
                {
                    "l": "攀枝花市",
                    "v": 536
                },
                {
                    "l": "遂宁市",
                    "v": 538
                },
                {
                    "l": "雅安市",
                    "v": 540
                },
                {
                    "l": "宜宾市",
                    "v": 541
                },
                {
                    "l": "资阳市",
                    "v": 542
                },
                {
                    "l": "自贡市",
                    "v": 543
                }
            ],
            "8": [
                {
                    "l": "安庆市",
                    "v": 101
                },
                {
                    "l": "蚌埠市",
                    "v": 102
                },
                {
                    "l": "亳州市",
                    "v": 103
                },
                {
                    "l": "巢湖市",
                    "v": 104
                },
                {
                    "l": "池州市",
                    "v": 105
                },
                {
                    "l": "滁州市",
                    "v": 106
                },
                {
                    "l": "阜阳市",
                    "v": 107
                },
                {
                    "l": "合肥市",
                    "v": 110
                },
                {
                    "l": "淮北市",
                    "v": 111
                },
                {
                    "l": "淮南市",
                    "v": 112
                },
                {
                    "l": "黄山市",
                    "v": 113
                },
                {
                    "l": "六安市",
                    "v": 115
                },
                {
                    "l": "马鞍山市",
                    "v": 116
                },
                {
                    "l": "铜陵市",
                    "v": 118
                },
                {
                    "l": "芜湖市",
                    "v": 119
                },
                {
                    "l": "宿州市",
                    "v": 120
                },
                {
                    "l": "宣城市",
                    "v": 121
                }
            ],
            "23": [
                {
                    "l": "鞍山市",
                    "v": 413
                },
                {
                    "l": "本溪市",
                    "v": 414
                },
                {
                    "l": "朝阳市",
                    "v": 415
                },
                {
                    "l": "大连市",
                    "v": 416
                },
                {
                    "l": "丹东市",
                    "v": 417
                },
                {
                    "l": "抚顺市",
                    "v": 418
                },
                {
                    "l": "阜新市",
                    "v": 419
                },
                {
                    "l": "葫芦岛市",
                    "v": 421
                },
                {
                    "l": "锦州市",
                    "v": 422
                },
                {
                    "l": "辽阳市",
                    "v": 423
                },
                {
                    "l": "盘锦市",
                    "v": 424
                },
                {
                    "l": "沈阳市",
                    "v": 425
                },
                {
                    "l": "铁岭市",
                    "v": 426
                },
                {
                    "l": "营口市",
                    "v": 427
                }
            ],
            "31": [
                {
                    "l": "拉萨市",
                    "v": 546
                },
                {
                    "l": "林芝地区",
                    "v": 547
                },
                {
                    "l": "那曲地区",
                    "v": 548
                },
                {
                    "l": "日喀则地区",
                    "v": 549
                }
            ],
            "16": [
                {
                    "l": "安阳市",
                    "v": 243
                },
                {
                    "l": "鹤壁市",
                    "v": 246
                },
                {
                    "l": "焦作市",
                    "v": 249
                },
                {
                    "l": "开封市",
                    "v": 250
                },
                {
                    "l": "漯河市",
                    "v": 252
                },
                {
                    "l": "洛阳市",
                    "v": 253
                },
                {
                    "l": "南阳市",
                    "v": 254
                },
                {
                    "l": "平顶山市",
                    "v": 255
                },
                {
                    "l": "濮阳市",
                    "v": 256
                },
                {
                    "l": "三门峡市",
                    "v": 257
                },
                {
                    "l": "商丘市",
                    "v": 258
                },
                {
                    "l": "新乡市",
                    "v": 261
                },
                {
                    "l": "信阳市",
                    "v": 262
                },
                {
                    "l": "许昌市",
                    "v": 263
                },
                {
                    "l": "郑州市",
                    "v": 266
                },
                {
                    "l": "周口市",
                    "v": 267
                },
                {
                    "l": "驻马店市",
                    "v": 268
                }
            ],
            "22": [
                {
                    "l": "抚州市",
                    "v": 401
                },
                {
                    "l": "赣州市",
                    "v": 402
                },
                {
                    "l": "吉安市",
                    "v": 403
                },
                {
                    "l": "景德镇市",
                    "v": 404
                },
                {
                    "l": "九江市",
                    "v": 406
                },
                {
                    "l": "南昌市",
                    "v": 407
                },
                {
                    "l": "萍乡市",
                    "v": 408
                },
                {
                    "l": "上饶市",
                    "v": 409
                },
                {
                    "l": "新余市",
                    "v": 410
                },
                {
                    "l": "宜春市",
                    "v": 411
                },
                {
                    "l": "鹰潭市",
                    "v": 412
                }
            ],
            "34": [
                {
                    "l": "杭州市",
                    "v": 604
                },
                {
                    "l": "湖州市",
                    "v": 605
                },
                {
                    "l": "嘉兴市",
                    "v": 606
                },
                {
                    "l": "金华市",
                    "v": 608
                },
                {
                    "l": "丽水市",
                    "v": 611
                },
                {
                    "l": "宁波市",
                    "v": 615
                },
                {
                    "l": "衢州市",
                    "v": 617
                },
                {
                    "l": "绍兴市",
                    "v": 619
                },
                {
                    "l": "台州市",
                    "v": 621
                },
                {
                    "l": "温州市",
                    "v": 624
                },
                {
                    "l": "舟山市",
                    "v": 630
                }
            ],
            "32": [
                {
                    "l": "阿克苏地区",
                    "v": 551
                },
                {
                    "l": "阿勒泰市",
                    "v": 554
                },
                {
                    "l": "巴音郭楞蒙古自治州",
                    "v": 556
                },
                {
                    "l": "博尔塔拉蒙古自治州",
                    "v": 557
                },
                {
                    "l": "昌吉回族自治州",
                    "v": 560
                },
                {
                    "l": "哈密市",
                    "v": 563
                },
                {
                    "l": "和田市",
                    "v": 564
                },
                {
                    "l": "喀什市",
                    "v": 565
                },
                {
                    "l": "克拉玛依市",
                    "v": 566
                },
                {
                    "l": "石河子市",
                    "v": 570
                },
                {
                    "l": "塔城市",
                    "v": 571
                },
                {
                    "l": "吐鲁番市",
                    "v": 572
                },
                {
                    "l": "乌鲁木齐市",
                    "v": 573
                },
                {
                    "l": "伊犁市",
                    "v": 576
                },
                {
                    "l": "克孜勒苏柯尔克孜",
                    "v": 869
                },
                {
                    "l": "五家渠",
                    "v": 870
                }
            ],
            "9": [
                {
                    "l": "福州市",
                    "v": 124
                },
                {
                    "l": "龙岩市",
                    "v": 126
                },
                {
                    "l": "南平市",
                    "v": 127
                },
                {
                    "l": "宁德市",
                    "v": 128
                },
                {
                    "l": "莆田市",
                    "v": 129
                },
                {
                    "l": "泉州市",
                    "v": 130
                },
                {
                    "l": "三明市",
                    "v": 131
                },
                {
                    "l": "厦门市",
                    "v": 132
                },
                {
                    "l": "漳州市",
                    "v": 138
                }
            ],
            "33": [
                {
                    "l": "保山市",
                    "v": 578
                },
                {
                    "l": "楚雄市",
                    "v": 579
                },
                {
                    "l": "大理市",
                    "v": 580
                },
                {
                    "l": "德宏傣族景颇族自治州",
                    "v": 581
                },
                {
                    "l": "红河哈尼族彝族自治州",
                    "v": 585
                },
                {
                    "l": "昆明市",
                    "v": 587
                },
                {
                    "l": "丽江市",
                    "v": 589
                },
                {
                    "l": "临沧市",
                    "v": 590
                },
                {
                    "l": "普洱市",
                    "v": 593
                },
                {
                    "l": "曲靖市",
                    "v": 594
                },
                {
                    "l": "文山市",
                    "v": 595
                },
                {
                    "l": "玉溪市",
                    "v": 597
                },
                {
                    "l": "昭通市",
                    "v": 598
                }
            ],
            "21": [
                {
                    "l": "常州市",
                    "v": 363
                },
                {
                    "l": "淮安市",
                    "v": 367
                },
                {
                    "l": "连云港市",
                    "v": 375
                },
                {
                    "l": "南京市",
                    "v": 376
                },
                {
                    "l": "南通市",
                    "v": 377
                },
                {
                    "l": "苏州市",
                    "v": 381
                },
                {
                    "l": "泰州市",
                    "v": 383
                },
                {
                    "l": "无锡市",
                    "v": 386
                },
                {
                    "l": "宿迁市",
                    "v": 391
                },
                {
                    "l": "徐州市",
                    "v": 392
                },
                {
                    "l": "盐城市",
                    "v": 393
                },
                {
                    "l": "扬州市",
                    "v": 395
                },
                {
                    "l": "镇江市",
                    "v": 399
                }
            ],
            "1": [
                {
                    "l": "昌平区",
                    "v": 742
                },
                {
                    "l": "朝阳区",
                    "v": 743
                },
                {
                    "l": "崇文区",
                    "v": 744
                },
                {
                    "l": "大兴区",
                    "v": 745
                },
                {
                    "l": "东城区",
                    "v": 746
                },
                {
                    "l": "房山区",
                    "v": 747
                },
                {
                    "l": "丰台区",
                    "v": 748
                },
                {
                    "l": "海淀区",
                    "v": 749
                },
                {
                    "l": "怀柔区",
                    "v": 750
                },
                {
                    "l": "门头沟区",
                    "v": 751
                },
                {
                    "l": "密云县",
                    "v": 752
                },
                {
                    "l": "平谷区",
                    "v": 753
                },
                {
                    "l": "石景山区",
                    "v": 754
                },
                {
                    "l": "顺义区",
                    "v": 755
                },
                {
                    "l": "通州区",
                    "v": 756
                },
                {
                    "l": "西城区",
                    "v": 757
                },
                {
                    "l": "宣武区",
                    "v": 758
                },
                {
                    "l": "延庆县",
                    "v": 759
                }
            ],
            "29": [
                {
                    "l": "安康市",
                    "v": 503
                },
                {
                    "l": "宝鸡市",
                    "v": 504
                },
                {
                    "l": "汉中市",
                    "v": 506
                },
                {
                    "l": "商洛市",
                    "v": 508
                },
                {
                    "l": "铜川市",
                    "v": 509
                },
                {
                    "l": "渭南市",
                    "v": 510
                },
                {
                    "l": "西安市",
                    "v": 511
                },
                {
                    "l": "咸阳市",
                    "v": 512
                },
                {
                    "l": "延安市",
                    "v": 513
                },
                {
                    "l": "榆林市",
                    "v": 515
                }
            ],
            "14": [
                {
                    "l": "儋州市",
                    "v": 218
                },
                {
                    "l": "东方市",
                    "v": 219
                },
                {
                    "l": "海口市",
                    "v": 220
                },
                {
                    "l": "琼海市",
                    "v": 221
                },
                {
                    "l": "三亚市",
                    "v": 223
                },
                {
                    "l": "文昌市",
                    "v": 225
                },
                {
                    "l": "五指山",
                    "v": 867
                },
                {
                    "l": "万宁",
                    "v": 868
                }
            ],
            "24": [
                {
                    "l": "阿拉善盟",
                    "v": 428
                },
                {
                    "l": "巴彦淖尔市",
                    "v": 429
                },
                {
                    "l": "包头市",
                    "v": 430
                },
                {
                    "l": "赤峰市",
                    "v": 431
                },
                {
                    "l": "鄂尔多斯市",
                    "v": 432
                },
                {
                    "l": "呼和浩特市",
                    "v": 434
                },
                {
                    "l": "呼伦贝尔市",
                    "v": 435
                },
                {
                    "l": "通辽市",
                    "v": 437
                },
                {
                    "l": "乌海市",
                    "v": 438
                },
                {
                    "l": "乌兰察布市",
                    "v": 439
                },
                {
                    "l": "锡林郭勒盟",
                    "v": 442
                },
                {
                    "l": "兴安盟",
                    "v": 444
                }
            ],
            "4": [
                {
                    "l": "巴南区",
                    "v": 778
                },
                {
                    "l": "北碚区",
                    "v": 779
                },
                {
                    "l": "璧山县",
                    "v": 780
                },
                {
                    "l": "城口县",
                    "v": 781
                },
                {
                    "l": "大渡口区",
                    "v": 782
                },
                {
                    "l": "大足县",
                    "v": 783
                },
                {
                    "l": "垫江县",
                    "v": 784
                },
                {
                    "l": "丰都县",
                    "v": 785
                },
                {
                    "l": "奉节县",
                    "v": 786
                },
                {
                    "l": "涪陵区",
                    "v": 787
                },
                {
                    "l": "合川区",
                    "v": 788
                },
                {
                    "l": "江北区",
                    "v": 789
                },
                {
                    "l": "江津区",
                    "v": 790
                },
                {
                    "l": "九龙坡区",
                    "v": 791
                },
                {
                    "l": "开县",
                    "v": 792
                },
                {
                    "l": "梁平县",
                    "v": 793
                },
                {
                    "l": "南岸区",
                    "v": 794
                },
                {
                    "l": "南川区",
                    "v": 795
                },
                {
                    "l": "彭水县",
                    "v": 796
                },
                {
                    "l": "綦江县",
                    "v": 797
                },
                {
                    "l": "黔江区",
                    "v": 798
                },
                {
                    "l": "荣昌县",
                    "v": 799
                },
                {
                    "l": "沙坪坝区",
                    "v": 800
                },
                {
                    "l": "石柱县",
                    "v": 801
                },
                {
                    "l": "双桥区",
                    "v": 802
                },
                {
                    "l": "铜梁县",
                    "v": 803
                },
                {
                    "l": "潼南县",
                    "v": 804
                },
                {
                    "l": "万盛区",
                    "v": 805
                },
                {
                    "l": "万州区",
                    "v": 806
                },
                {
                    "l": "巫山县",
                    "v": 807
                },
                {
                    "l": "巫溪县",
                    "v": 808
                },
                {
                    "l": "武隆县",
                    "v": 809
                },
                {
                    "l": "秀山县",
                    "v": 810
                },
                {
                    "l": "永川区",
                    "v": 811
                },
                {
                    "l": "酉阳县",
                    "v": 812
                },
                {
                    "l": "渝北区",
                    "v": 813
                },
                {
                    "l": "渝中区",
                    "v": 814
                },
                {
                    "l": "云阳县",
                    "v": 815
                },
                {
                    "l": "长寿区",
                    "v": 816
                },
                {
                    "l": "忠县",
                    "v": 817
                }
            ],
            "19": [
                {
                    "l": "常德市",
                    "v": 328
                },
                {
                    "l": "郴州市",
                    "v": 329
                },
                {
                    "l": "衡阳市",
                    "v": 330
                },
                {
                    "l": "怀化市",
                    "v": 331
                },
                {
                    "l": "娄底市",
                    "v": 334
                },
                {
                    "l": "邵阳市",
                    "v": 335
                },
                {
                    "l": "湘潭市",
                    "v": 337
                },
                {
                    "l": "湘西土家族苗族自治州",
                    "v": 338
                },
                {
                    "l": "益阳市",
                    "v": 339
                },
                {
                    "l": "永州市",
                    "v": 340
                },
                {
                    "l": "岳阳市",
                    "v": 341
                },
                {
                    "l": "张家界市",
                    "v": 342
                },
                {
                    "l": "长沙市",
                    "v": 343
                },
                {
                    "l": "株洲市",
                    "v": 344
                }
            ],
            "26": [
                {
                    "l": "海东地区",
                    "v": 454
                },
                {
                    "l": "海西蒙古族藏族自治州",
                    "v": 456
                },
                {
                    "l": "西宁市",
                    "v": 458
                },
                {
                    "l": "玉树藏族自治州",
                    "v": 459
                }
            ],
            "11": [
                {
                    "l": "潮州市",
                    "v": 157
                },
                {
                    "l": "东莞市",
                    "v": 158
                },
                {
                    "l": "佛山市",
                    "v": 160
                },
                {
                    "l": "广州市",
                    "v": 162
                },
                {
                    "l": "河源市",
                    "v": 163
                },
                {
                    "l": "惠州市",
                    "v": 164
                },
                {
                    "l": "江门市",
                    "v": 166
                },
                {
                    "l": "揭阳市",
                    "v": 167
                },
                {
                    "l": "茂名市",
                    "v": 169
                },
                {
                    "l": "梅州市",
                    "v": 170
                },
                {
                    "l": "清远市",
                    "v": 172
                },
                {
                    "l": "汕头市",
                    "v": 173
                },
                {
                    "l": "汕尾市",
                    "v": 174
                },
                {
                    "l": "韶关市",
                    "v": 175
                },
                {
                    "l": "深圳市",
                    "v": 176
                },
                {
                    "l": "阳江市",
                    "v": 180
                },
                {
                    "l": "云浮市",
                    "v": 182
                },
                {
                    "l": "湛江市",
                    "v": 184
                },
                {
                    "l": "肇庆市",
                    "v": 185
                },
                {
                    "l": "中山市",
                    "v": 186
                },
                {
                    "l": "珠海市",
                    "v": 187
                }
            ],
            "18": [
                {
                    "l": "鄂州市",
                    "v": 304
                },
                {
                    "l": "恩施市",
                    "v": 305
                },
                {
                    "l": "黄冈市",
                    "v": 307
                },
                {
                    "l": "黄石市",
                    "v": 308
                },
                {
                    "l": "荆门市",
                    "v": 309
                },
                {
                    "l": "荆州市",
                    "v": 310
                },
                {
                    "l": "潜江市",
                    "v": 311
                },
                {
                    "l": "神农架林区",
                    "v": 312
                },
                {
                    "l": "十堰市",
                    "v": 313
                },
                {
                    "l": "随州市",
                    "v": 314
                },
                {
                    "l": "天门市",
                    "v": 315
                },
                {
                    "l": "武汉",
                    "v": 317
                },
                {
                    "l": "仙桃市",
                    "v": 319
                },
                {
                    "l": "咸宁市",
                    "v": 320
                },
                {
                    "l": "襄樊市",
                    "v": 321
                },
                {
                    "l": "孝感市",
                    "v": 323
                },
                {
                    "l": "宜昌市",
                    "v": 324
                }
            ],
            "3": [
                {
                    "l": "宝坻区",
                    "v": 760
                },
                {
                    "l": "北辰区",
                    "v": 761
                },
                {
                    "l": "大港区",
                    "v": 762
                },
                {
                    "l": "东丽区",
                    "v": 763
                },
                {
                    "l": "汉沽区",
                    "v": 764
                },
                {
                    "l": "河北区",
                    "v": 765
                },
                {
                    "l": "河东区",
                    "v": 766
                },
                {
                    "l": "和平区",
                    "v": 767
                },
                {
                    "l": "河西区",
                    "v": 768
                },
                {
                    "l": "红桥区",
                    "v": 769
                },
                {
                    "l": "蓟县",
                    "v": 770
                },
                {
                    "l": "津南区",
                    "v": 771
                },
                {
                    "l": "静海县",
                    "v": 772
                },
                {
                    "l": "南开区",
                    "v": 773
                },
                {
                    "l": "宁河县",
                    "v": 774
                },
                {
                    "l": "塘沽区",
                    "v": 775
                },
                {
                    "l": "武清区",
                    "v": 776
                },
                {
                    "l": "西青区",
                    "v": 777
                }
            ],
            "12": [
                {
                    "l": "百色市",
                    "v": 188
                },
                {
                    "l": "北海市",
                    "v": 189
                },
                {
                    "l": "防城港市",
                    "v": 191
                },
                {
                    "l": "贵港市",
                    "v": 193
                },
                {
                    "l": "桂林市",
                    "v": 194
                },
                {
                    "l": "河池市",
                    "v": 195
                },
                {
                    "l": "贺州市",
                    "v": 196
                },
                {
                    "l": "来宾市",
                    "v": 197
                },
                {
                    "l": "柳州市",
                    "v": 198
                },
                {
                    "l": "南宁市",
                    "v": 199
                },
                {
                    "l": "钦州市",
                    "v": 200
                },
                {
                    "l": "梧州市",
                    "v": 201
                },
                {
                    "l": "玉林市",
                    "v": 203
                }
            ],
            "27": [
                {
                    "l": "滨州市",
                    "v": 461
                },
                {
                    "l": "德州市",
                    "v": 462
                },
                {
                    "l": "东营市",
                    "v": 463
                },
                {
                    "l": "菏泽市",
                    "v": 466
                },
                {
                    "l": "济南市",
                    "v": 467
                },
                {
                    "l": "济宁市",
                    "v": 468
                },
                {
                    "l": "莱芜市",
                    "v": 470
                },
                {
                    "l": "聊城市",
                    "v": 472
                },
                {
                    "l": "临沂市",
                    "v": 473
                },
                {
                    "l": "青岛市",
                    "v": 474
                },
                {
                    "l": "日照市",
                    "v": 476
                },
                {
                    "l": "泰安市",
                    "v": 477
                },
                {
                    "l": "威海市",
                    "v": 479
                },
                {
                    "l": "潍坊市",
                    "v": 480
                },
                {
                    "l": "烟台市",
                    "v": 481
                },
                {
                    "l": "枣庄市",
                    "v": 482
                },
                {
                    "l": "淄博市",
                    "v": 485
                }
            ],
            "17": [
                {
                    "l": "大庆市",
                    "v": 272
                },
                {
                    "l": "大兴安岭地区",
                    "v": 273
                },
                {
                    "l": "哈尔滨市",
                    "v": 276
                },
                {
                    "l": "鹤岗市",
                    "v": 278
                },
                {
                    "l": "黑河市",
                    "v": 279
                },
                {
                    "l": "鸡西市",
                    "v": 282
                },
                {
                    "l": "佳木斯市",
                    "v": 284
                },
                {
                    "l": "牡丹江市",
                    "v": 287
                },
                {
                    "l": "七台河市",
                    "v": 289
                },
                {
                    "l": "齐齐哈尔市",
                    "v": 290
                },
                {
                    "l": "双鸭山市",
                    "v": 291
                },
                {
                    "l": "绥化市",
                    "v": 293
                },
                {
                    "l": "伊春市",
                    "v": 298
                }
            ],
            "2": [
                {
                    "l": "宝山区",
                    "v": 818
                },
                {
                    "l": "崇明县",
                    "v": 819
                },
                {
                    "l": "奉贤区",
                    "v": 820
                },
                {
                    "l": "虹口区",
                    "v": 821
                },
                {
                    "l": "黄浦区",
                    "v": 822
                },
                {
                    "l": "嘉定区",
                    "v": 823
                },
                {
                    "l": "金山区",
                    "v": 824
                },
                {
                    "l": "静安区",
                    "v": 825
                },
                {
                    "l": "卢湾区",
                    "v": 826
                },
                {
                    "l": "闵行区",
                    "v": 827
                },
                {
                    "l": "南汇区",
                    "v": 829
                },
                {
                    "l": "浦东新区",
                    "v": 830
                },
                {
                    "l": "普陀区",
                    "v": 831
                },
                {
                    "l": "青浦区",
                    "v": 832
                },
                {
                    "l": "松江区",
                    "v": 833
                },
                {
                    "l": "徐汇区",
                    "v": 834
                },
                {
                    "l": "杨浦区",
                    "v": 835
                },
                {
                    "l": "闸北区",
                    "v": 836
                },
                {
                    "l": "长宁区",
                    "v": 837
                }
            ],
            "13": [
                {
                    "l": "安顺市",
                    "v": 204
                },
                {
                    "l": "毕节市",
                    "v": 205
                },
                {
                    "l": "贵阳市",
                    "v": 208
                },
                {
                    "l": "六盘水市",
                    "v": 210
                },
                {
                    "l": "黔东南苗族侗族自治州",
                    "v": 211
                },
                {
                    "l": "黔南布依族苗族自治州",
                    "v": 212
                },
                {
                    "l": "黔西南布依族苗族自治州",
                    "v": 213
                },
                {
                    "l": "铜仁市",
                    "v": 215
                },
                {
                    "l": "遵义市",
                    "v": 217
                }
            ],
            "28": [
                {
                    "l": "大同市",
                    "v": 486
                },
                {
                    "l": "晋城市",
                    "v": 491
                },
                {
                    "l": "晋中市",
                    "v": 492
                },
                {
                    "l": "临汾市",
                    "v": 493
                },
                {
                    "l": "吕梁市",
                    "v": 494
                },
                {
                    "l": "朔州市",
                    "v": 495
                },
                {
                    "l": "太原市",
                    "v": 496
                },
                {
                    "l": "忻州市",
                    "v": 497
                },
                {
                    "l": "阳泉市",
                    "v": 498
                },
                {
                    "l": "运城市",
                    "v": 501
                },
                {
                    "l": "长治市",
                    "v": 502
                }
            ],
            "20": [
                {
                    "l": "白城市",
                    "v": 345
                },
                {
                    "l": "白山市",
                    "v": 346
                },
                {
                    "l": "吉林市",
                    "v": 351
                },
                {
                    "l": "辽源市",
                    "v": 352
                },
                {
                    "l": "四平市",
                    "v": 355
                },
                {
                    "l": "松原市",
                    "v": 356
                },
                {
                    "l": "通化市",
                    "v": 358
                },
                {
                    "l": "延边朝鲜族自治州",
                    "v": 359
                },
                {
                    "l": "长春市",
                    "v": 361
                }
            ],
            "25": [
                {
                    "l": "固原市",
                    "v": 446
                },
                {
                    "l": "石嘴山市",
                    "v": 447
                },
                {
                    "l": "吴忠市",
                    "v": 448
                },
                {
                    "l": "银川市",
                    "v": 449
                },
                {
                    "l": "中卫市",
                    "v": 450
                }
            ],
            "10": [
                {
                    "l": "白银市",
                    "v": 139
                },
                {
                    "l": "定西市",
                    "v": 140
                },
                {
                    "l": "嘉峪关市",
                    "v": 144
                },
                {
                    "l": "金昌市",
                    "v": 145
                },
                {
                    "l": "酒泉市",
                    "v": 146
                },
                {
                    "l": "兰州市",
                    "v": 147
                },
                {
                    "l": "临夏回族自治州",
                    "v": 148
                },
                {
                    "l": "陇南市",
                    "v": 150
                },
                {
                    "l": "平凉市",
                    "v": 151
                },
                {
                    "l": "庆阳市",
                    "v": 152
                },
                {
                    "l": "天水市",
                    "v": 153
                },
                {
                    "l": "武威市",
                    "v": 154
                },
                {
                    "l": "张掖市",
                    "v": 156
                }
            ]
        },
        "video_player" : [
            {
                // 标准播放器
                "v" : "standard_v0",
                "l" : "http://fe.baidu.com/doc/zhanglili/dan/standard-player.swf"
            },
            {
                // 标准播放器（带搜索框）
                "v" : "standard_v1",
                "l" : "http://fe.baidu.com/doc/zhanglili/dan/standard-player.swf"
            },
            {
                "v" : "default_logo",
                "l" : "http://img.baidu.com/adm/gm-logo-100x100.png"
            },
            {
                // FLV上传文件地址
                "v" : "upload_host",
                "l" : "http://yf-sdcrd-danbs01.yf01.baidu.com:8080"
            }
        ]
    }
}

var batchResult = {
    "success" : "true",
    "message" : {}
};
var formSuccess = {
    "success" : "true",
    "message" : {}
};
mockup.register('/system_const/read', sysConst);
